/*
Вычислите a+b

Исходные данные
a и b

Результат
a+b

Пример
исходные данные		результат
1 5					6
*/

#include <iostream>


int main()
{
	int A, B;
	std::cin >> A >> B;
	
	int result = A + B;
	std::cout << result << std::endl;

	return 0;
}
